<?
/*######################################################################
||------------------------------------------||
||-------------Patch Game 5Reel x9lines-----||
||-----------------V0.4---------------------||
||------------------------------------------||
|| автор скрипта "timur & K DIGITAL" контакт: timur_i_k@mail.ru
|| ¬ыразить благодарность автору: Z383822181680 R173615311561 U114479916902
|| распросторонение скрипта свободное с любезного разрешени€ автора
|| комерческое использование не ограничеваетс€
|| пожалуйста не убирайте копирайт
|| R#0910192319B1
########################################################################*/
/* помещ€ем этот файл в папку с игрой в скрипте игры делаем вставку
include ("patch9l5rv04.php");

перед обработкой ошибки

    if ( $action == "error" )
{
    echo "|error|error";
}
все защита установлена
актуальна дла игр
„укча
–езидент
‘рут коктейль
Ћаки ƒрынк
Ћаки ’аунтер
Ћ€гушка
√ном
√араж
 екс
*/
if ( $action<>"double" && $action<>"initfc" && $lines<>"1" && $lines<>"3" && $lines<>"5" && $lines<>"7"&& $lines<>"9" )
{   
     $action = "error";
     echo "|lines in corrupt";
}

if ($action<>"double" &&  $action<>"initfc" &&  $bet < 1 || 25 < $bet )
{
    $action = "error";
    echo "|bet in corrupt";
}
if ($action<>"double" &&  $action<>"initfc" &&  $lines < 1 || 9 < $lines )
{
    $action = "error";
}

if ( $user_balance < $betallt )
{
    $action = "error";
    echo "|cash not range";
}
?>